#version: 0.2
Ġ N
Ġ R
Ġ B
Ġ K
Ġ Q
x d
Ġ c
Ġ e
x e
Ġ d
ĠN f
x c
x f
Ġ g
Ġ h
Ġ a
Ġ b
Ġ f
ĠN c
ĠB e
ĠK f
Ġ O
x b
x g
ĠN d
ĠN e
ĠK g
ĠB d
ĠR a
ĠB g
ĠR e
ĠR d
ĠK e
ĠR c
ĠR f
ĠQ d
ĠB f
ĠQ e
ĠB b
ĠR b
ĠK d
ĠQ c
ĠK h
ĠN b
ĠB c
x a
x h
ĠN g
ĠQ f
ĠK c
ĠQ b
ĠN xd
Ġc xd
ĠN xe
ĠR h
ĠR g
ĠB xf
ĠK b
ĠR xd
ĠQ xd
ĠQ g
Ġe xd
ĠB xd
ĠB xc
ĠB xe
ĠR xe
ĠQ a
ĠR xc
Ġd xe
ĠQ h
Ġb xc
ĠB h
ĠQ xe
ĠR xf
Ġa xb
ĠN xc
Ġh xg
ĠNb d
Ġf xe
ĠN a
ĠN h
ĠR xa
ĠQ xf
Ġd xc
Ġg xf
ĠB a
ĠR xb
ĠN xf
ĠQ xc
Ġe xf
ĠB xg
ĠQ xb
ĠB xb
ĠRa d
ĠK a
ĠR xg
ĠR xh
ĠK xg
Ġf xg
ĠK xf
ĠQ xg
ĠN xb
ĠQ xa
ĠRf d
ĠN xg
ĠRa c
Ġc xb
ĠRf e
ĠB xa
Ġg xh
ĠB xh
ĠQ xh
ĠK xd
Ġb xa
ĠK xe
ĠNg e
ĠN xa
ĠRa e
ĠK xh
ĠRa b
ĠRf c
N f
ĠN xh
ĠK xc
ĠNf d
ĠNg f
ĠK xb
ĠK xa
ĠRh e
ĠRe d
ĠNc e
ĠRc d
ĠRd e
ĠRh d
ĠRf b
ĠRa f
ĠRh g
ĠNb c
ĠNd f
ĠRd d
ĠRh f
ĠNd e
ĠRb c
ĠRe c
ĠRd c
ĠRe e
ĠRb d
ĠRc c
ĠNe d
ĠRc e
ĠRd f
ĠNc d
ĠRd g
ĠNd b
ĠNf e
ĠRh c
ĠRa a
ĠRb e
ĠRb b
ĠNe c
ĠRf f
ĠNh f
ĠNb xd
ĠRe f
ĠRa g
ĠRe b
ĠRf a
ĠNd xe
ĠNc xe
ĠNe g
ĠNe f
ĠNd c
ĠNa c
ĠRc b
ĠNg xe
ĠRg f
ĠNf xd
ĠRd b
ĠRc f
ĠRf xd
ĠRa xd
N c
ĠRd h
ĠNf g
ĠRg e
ĠRh b
ĠNc b
ĠRb f
ĠRa xc
ĠRe a
ĠRg g
ĠRh h
ĠNf xe
ĠRf g
ĠRg d
ĠNc xd
ĠNe xd
ĠRc a
ĠRa h
ĠRb a
ĠRf xf
ĠRc g
ĠRe g
ĠRd a
ĠRd xd
ĠNa b
ĠRe xe
ĠRc xc
ĠRg c
ĠRb g
ĠRe xd
ĠRb xb
ĠRg h
ĠRa xa
ĠNd xc
ĠRh a
ĠNh g
ĠRc xd
ĠRf xe
ĠNd xb
ĠRb xc
ĠRg xg
ĠRa xb
ĠRf h
ĠRf xc
ĠNg xf
ĠRe h
ĠNe xf
ĠNb a
ĠNd xf
ĠRc h
ĠQf f
ĠNa xc
ĠQg g
ĠNg h
ĠRh xf
ĠRg b
ĠQe e
ĠRd xe
ĠRd xc
ĠNe xc
ĠNc xb
ĠNf xg
ĠQc c
ĠQb b
ĠRa xe
ĠQd d
ĠNe xg
ĠRh xh
ĠRb xd
ĠNh xf
ĠRb h
ĠNf h
ĠNb xc
ĠNc a
ĠRd xf
ĠRe xc
ĠQh h
ĠRe xf
ĠQd b
ĠQc a
ĠQa a
ĠQe c
ĠRc xe
ĠRc xb
ĠRb xa
ĠQe g
ĠRg a
ĠRb xe
ĠRg xf
ĠQf h
ĠQf d
ĠRa xf
ĠQd f
ĠRc xf
ĠRh xe
ĠRh xg
ĠNa xb
ĠQc e
ĠRd xb
ĠRh xd
ĠNh xg
ĠQg e
ĠRc xa
ĠRe xb
ĠQb d
ĠRb xf
ĠQg f
ĠRg xe
ĠNb xa
ĠQh f
ĠRf xg
ĠQf e
ĠRg xd
ĠRf xb
ĠQc d
ĠQb c
ĠQd e
ĠQa b
ĠQh g
ĠQa c
ĠRh xc
ĠQe d
ĠRd xa
ĠRd xg
ĠNg xh
ĠQe f
N h
ĠQd c
ĠQa d
ĠNf xh
ĠRe xg
ĠQh e
ĠQb e
ĠRg xh
ĠQf g
ĠQg d
ĠNc xa
ĠRe xa
ĠQc b
ĠQf c
ĠQa e
ĠQc f
ĠRc xg
N a
ĠQh d
ĠQd g
ĠRa xg
ĠRf xa
ĠQb f
ĠRg xc
ĠQe b
ĠRf xh
ĠQf b
ĠQg c
ĠRb xg
ĠQc g
ĠQa f
ĠQh c
ĠRd xh
ĠQe h
ĠRe xh
ĠQb g
ĠQf xf
ĠQa g
ĠQg xg
ĠRh xb
ĠQd h
ĠQe xe
ĠQe xf
ĠQg b
ĠRg xb
ĠQe a
ĠQd a
ĠRc xh
ĠQh xh
ĠQd xd
ĠQc xc
ĠQf xg
ĠQd xf
ĠQd xe
ĠQb xb
ĠQe xg
ĠQc xf
ĠQh b
ĠRa xh
ĠQc h
ĠRg xa
ĠQg xf
ĠQa xa
ĠQc xd
ĠQf xe
ĠQb h
ĠQh xf
ĠRb xh
ĠQg h
ĠQc xe
ĠQb xe
ĠQd xc
ĠQb xc
ĠQb a
ĠQh xg
ĠRh xa
ĠQc xg
ĠQb xd
ĠQd xg
ĠQe xd
ĠQb xf
ĠQg a
ĠQa xb
ĠQf a
ĠQa xc
ĠQa xe
ĠQg xe
ĠQa h
ĠQa xd
ĠQf xd
ĠQe xc
ĠQc xb
ĠQh a
ĠQf xc
ĠQg xd
ĠQh xe
ĠQd xb
ĠQg xc
ĠQb xg
ĠQh xc
ĠQe xb
ĠQf xb
ĠQh xd
ĠQa xf
ĠQg xa
ĠQb xh
ĠQg xb
ĠQd xh
ĠQa xg
ĠQb xa
ĠQg xh
ĠQe xa
ĠBh g
ĠQc xa
ĠQf xh
ĠQh xb
ĠQf xa
ĠQe xh
ĠQc xh
ĠBe d
ĠQd xa
ĠBf e
ĠBg d
ĠBb d
ĠBc e
ĠBa d
ĠBa e
ĠBe f
ĠBg f
ĠBb c
ĠBb e
ĠQa xh
ĠQh xa
ĠBe g
ĠBd f
ĠBf d
ĠBc d
ĠBh e
ĠBh f
ĠBa c
ĠBd a
ĠBd c
ĠBd e
ĠBg c
ĠBg e
ĠBg xe
ĠBf g
ĠBf h
ĠBc g
ĠBh d
ĠBh xf
ĠBa b
