{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "ĠN": 257,
      "ĠR": 258,
      "ĠB": 259,
      "ĠK": 260,
      "ĠQ": 261,
      "xd": 262,
      "Ġc": 263,
      "Ġe": 264,
      "xe": 265,
      "Ġd": 266,
      "ĠNf": 267,
      "xc": 268,
      "xf": 269,
      "Ġg": 270,
      "Ġh": 271,
      "Ġa": 272,
      "Ġb": 273,
      "Ġf": 274,
      "ĠNc": 275,
      "ĠBe": 276,
      "ĠKf": 277,
      "ĠO": 278,
      "xb": 279,
      "xg": 280,
      "ĠNd": 281,
      "ĠNe": 282,
      "ĠKg": 283,
      "ĠBd": 284,
      "ĠRa": 285,
      "ĠBg": 286,
      "ĠRe": 287,
      "ĠRd": 288,
      "ĠKe": 289,
      "ĠRc": 290,
      "ĠRf": 291,
      "ĠQd": 292,
      "ĠBf": 293,
      "ĠQe": 294,
      "ĠBb": 295,
      "ĠRb": 296,
      "ĠKd": 297,
      "ĠQc": 298,
      "ĠKh": 299,
      "ĠNb": 300,
      "ĠBc": 301,
      "xa": 302,
      "xh": 303,
      "ĠNg": 304,
      "ĠQf": 305,
      "ĠKc": 306,
      "ĠQb": 307,
      "ĠNxd": 308,
      "Ġcxd": 309,
      "ĠNxe": 310,
      "ĠRh": 311,
      "ĠRg": 312,
      "ĠBxf": 313,
      "ĠKb": 314,
      "ĠRxd": 315,
      "ĠQxd": 316,
      "ĠQg": 317,
      "Ġexd": 318,
      "ĠBxd": 319,
      "ĠBxc": 320,
      "ĠBxe": 321,
      "ĠRxe": 322,
      "ĠQa": 323,
      "ĠRxc": 324,
      "Ġdxe": 325,
      "ĠQh": 326,
      "Ġbxc": 327,
      "ĠBh": 328,
      "ĠQxe": 329,
      "ĠRxf": 330,
      "Ġaxb": 331,
      "ĠNxc": 332,
      "Ġhxg": 333,
      "ĠNbd": 334,
      "Ġfxe": 335,
      "ĠNa": 336,
      "ĠNh": 337,
      "ĠRxa": 338,
      "ĠQxf": 339,
      "Ġdxc": 340,
      "Ġgxf": 341,
      "ĠBa": 342,
      "ĠRxb": 343,
      "ĠNxf": 344,
      "ĠQxc": 345,
      "Ġexf": 346,
      "ĠBxg": 347,
      "ĠQxb": 348,
      "ĠBxb": 349,
      "ĠRad": 350,
      "ĠKa": 351,
      "ĠRxg": 352,
      "ĠRxh": 353,
      "ĠKxg": 354,
      "Ġfxg": 355,
      "ĠKxf": 356,
      "ĠQxg": 357,
      "ĠNxb": 358,
      "ĠQxa": 359,
      "ĠRfd": 360,
      "ĠNxg": 361,
      "ĠRac": 362,
      "Ġcxb": 363,
      "ĠRfe": 364,
      "ĠBxa": 365,
      "Ġgxh": 366,
      "ĠBxh": 367,
      "ĠQxh": 368,
      "ĠKxd": 369,
      "Ġbxa": 370,
      "ĠKxe": 371,
      "ĠNge": 372,
      "ĠNxa": 373,
      "ĠRae": 374,
      "ĠKxh": 375,
      "ĠRab": 376,
      "ĠRfc": 377,
      "Nf": 378,
      "ĠNxh": 379,
      "ĠKxc": 380,
      "ĠNfd": 381,
      "ĠNgf": 382,
      "ĠKxb": 383,
      "ĠKxa": 384,
      "ĠRhe": 385,
      "ĠRed": 386,
      "ĠNce": 387,
      "ĠRcd": 388,
      "ĠRde": 389,
      "ĠRhd": 390,
      "ĠRfb": 391,
      "ĠRaf": 392,
      "ĠRhg": 393,
      "ĠNbc": 394,
      "ĠNdf": 395,
      "ĠRdd": 396,
      "ĠRhf": 397,
      "ĠNde": 398,
      "ĠRbc": 399,
      "ĠRec": 400,
      "ĠRdc": 401,
      "ĠRee": 402,
      "ĠRbd": 403,
      "ĠRcc": 404,
      "ĠNed": 405,
      "ĠRce": 406,
      "ĠRdf": 407,
      "ĠNcd": 408,
      "ĠRdg": 409,
      "ĠNdb": 410,
      "ĠNfe": 411,
      "ĠRhc": 412,
      "ĠRaa": 413,
      "ĠRbe": 414,
      "ĠRbb": 415,
      "ĠNec": 416,
      "ĠRff": 417,
      "ĠNhf": 418,
      "ĠNbxd": 419,
      "ĠRef": 420,
      "ĠRag": 421,
      "ĠReb": 422,
      "ĠRfa": 423,
      "ĠNdxe": 424,
      "ĠNcxe": 425,
      "ĠNeg": 426,
      "ĠNef": 427,
      "ĠNdc": 428,
      "ĠNac": 429,
      "ĠRcb": 430,
      "ĠNgxe": 431,
      "ĠRgf": 432,
      "ĠNfxd": 433,
      "ĠRdb": 434,
      "ĠRcf": 435,
      "ĠRfxd": 436,
      "ĠRaxd": 437,
      "Nc": 438,
      "ĠRdh": 439,
      "ĠNfg": 440,
      "ĠRge": 441,
      "ĠRhb": 442,
      "ĠNcb": 443,
      "ĠRbf": 444,
      "ĠRaxc": 445,
      "ĠRea": 446,
      "ĠRgg": 447,
      "ĠRhh": 448,
      "ĠNfxe": 449,
      "ĠRfg": 450,
      "ĠRgd": 451,
      "ĠNcxd": 452,
      "ĠNexd": 453,
      "ĠRca": 454,
      "ĠRah": 455,
      "ĠRba": 456,
      "ĠRfxf": 457,
      "ĠRcg": 458,
      "ĠReg": 459,
      "ĠRda": 460,
      "ĠRdxd": 461,
      "ĠNab": 462,
      "ĠRexe": 463,
      "ĠRcxc": 464,
      "ĠRgc": 465,
      "ĠRbg": 466,
      "ĠRexd": 467,
      "ĠRbxb": 468,
      "ĠRgh": 469,
      "ĠRaxa": 470,
      "ĠNdxc": 471,
      "ĠRha": 472,
      "ĠNhg": 473,
      "ĠRcxd": 474,
      "ĠRfxe": 475,
      "ĠNdxb": 476,
      "ĠRbxc": 477,
      "ĠRgxg": 478,
      "ĠRaxb": 479,
      "ĠRfh": 480,
      "ĠRfxc": 481,
      "ĠNgxf": 482,
      "ĠReh": 483,
      "ĠNexf": 484,
      "ĠNba": 485,
      "ĠNdxf": 486,
      "ĠRch": 487,
      "ĠQff": 488,
      "ĠNaxc": 489,
      "ĠQgg": 490,
      "ĠNgh": 491,
      "ĠRhxf": 492,
      "ĠRgb": 493,
      "ĠQee": 494,
      "ĠRdxe": 495,
      "ĠRdxc": 496,
      "ĠNexc": 497,
      "ĠNcxb": 498,
      "ĠNfxg": 499,
      "ĠQcc": 500,
      "ĠQbb": 501,
      "ĠRaxe": 502,
      "ĠQdd": 503,
      "ĠNexg": 504,
      "ĠRhxh": 505,
      "ĠRbxd": 506,
      "ĠNhxf": 507,
      "ĠRbh": 508,
      "ĠNfh": 509,
      "ĠNbxc": 510,
      "ĠNca": 511,
      "ĠRdxf": 512,
      "ĠRexc": 513,
      "ĠQhh": 514,
      "ĠRexf": 515,
      "ĠQdb": 516,
      "ĠQca": 517,
      "ĠQaa": 518,
      "ĠQec": 519,
      "ĠRcxe": 520,
      "ĠRcxb": 521,
      "ĠRbxa": 522,
      "ĠQeg": 523,
      "ĠRga": 524,
      "ĠRbxe": 525,
      "ĠRgxf": 526,
      "ĠQfh": 527,
      "ĠQfd": 528,
      "ĠRaxf": 529,
      "ĠQdf": 530,
      "ĠRcxf": 531,
      "ĠRhxe": 532,
      "ĠRhxg": 533,
      "ĠNaxb": 534,
      "ĠQce": 535,
      "ĠRdxb": 536,
      "ĠRhxd": 537,
      "ĠNhxg": 538,
      "ĠQge": 539,
      "ĠRcxa": 540,
      "ĠRexb": 541,
      "ĠQbd": 542,
      "ĠRbxf": 543,
      "ĠQgf": 544,
      "ĠRgxe": 545,
      "ĠNbxa": 546,
      "ĠQhf": 547,
      "ĠRfxg": 548,
      "ĠQfe": 549,
      "ĠRgxd": 550,
      "ĠRfxb": 551,
      "ĠQcd": 552,
      "ĠQbc": 553,
      "ĠQde": 554,
      "ĠQab": 555,
      "ĠQhg": 556,
      "ĠQac": 557,
      "ĠRhxc": 558,
      "ĠQed": 559,
      "ĠRdxa": 560,
      "ĠRdxg": 561,
      "ĠNgxh": 562,
      "ĠQef": 563,
      "Nh": 564,
      "ĠQdc": 565,
      "ĠQad": 566,
      "ĠNfxh": 567,
      "ĠRexg": 568,
      "ĠQhe": 569,
      "ĠQbe": 570,
      "ĠRgxh": 571,
      "ĠQfg": 572,
      "ĠQgd": 573,
      "ĠNcxa": 574,
      "ĠRexa": 575,
      "ĠQcb": 576,
      "ĠQfc": 577,
      "ĠQae": 578,
      "ĠQcf": 579,
      "ĠRcxg": 580,
      "Na": 581,
      "ĠQhd": 582,
      "ĠQdg": 583,
      "ĠRaxg": 584,
      "ĠRfxa": 585,
      "ĠQbf": 586,
      "ĠRgxc": 587,
      "ĠQeb": 588,
      "ĠRfxh": 589,
      "ĠQfb": 590,
      "ĠQgc": 591,
      "ĠRbxg": 592,
      "ĠQcg": 593,
      "ĠQaf": 594,
      "ĠQhc": 595,
      "ĠRdxh": 596,
      "ĠQeh": 597,
      "ĠRexh": 598,
      "ĠQbg": 599,
      "ĠQfxf": 600,
      "ĠQag": 601,
      "ĠQgxg": 602,
      "ĠRhxb": 603,
      "ĠQdh": 604,
      "ĠQexe": 605,
      "ĠQexf": 606,
      "ĠQgb": 607,
      "ĠRgxb": 608,
      "ĠQea": 609,
      "ĠQda": 610,
      "ĠRcxh": 611,
      "ĠQhxh": 612,
      "ĠQdxd": 613,
      "ĠQcxc": 614,
      "ĠQfxg": 615,
      "ĠQdxf": 616,
      "ĠQdxe": 617,
      "ĠQbxb": 618,
      "ĠQexg": 619,
      "ĠQcxf": 620,
      "ĠQhb": 621,
      "ĠRaxh": 622,
      "ĠQch": 623,
      "ĠRgxa": 624,
      "ĠQgxf": 625,
      "ĠQaxa": 626,
      "ĠQcxd": 627,
      "ĠQfxe": 628,
      "ĠQbh": 629,
      "ĠQhxf": 630,
      "ĠRbxh": 631,
      "ĠQgh": 632,
      "ĠQcxe": 633,
      "ĠQbxe": 634,
      "ĠQdxc": 635,
      "ĠQbxc": 636,
      "ĠQba": 637,
      "ĠQhxg": 638,
      "ĠRhxa": 639,
      "ĠQcxg": 640,
      "ĠQbxd": 641,
      "ĠQdxg": 642,
      "ĠQexd": 643,
      "ĠQbxf": 644,
      "ĠQga": 645,
      "ĠQaxb": 646,
      "ĠQfa": 647,
      "ĠQaxc": 648,
      "ĠQaxe": 649,
      "ĠQgxe": 650,
      "ĠQah": 651,
      "ĠQaxd": 652,
      "ĠQfxd": 653,
      "ĠQexc": 654,
      "ĠQcxb": 655,
      "ĠQha": 656,
      "ĠQfxc": 657,
      "ĠQgxd": 658,
      "ĠQhxe": 659,
      "ĠQdxb": 660,
      "ĠQgxc": 661,
      "ĠQbxg": 662,
      "ĠQhxc": 663,
      "ĠQexb": 664,
      "ĠQfxb": 665,
      "ĠQhxd": 666,
      "ĠQaxf": 667,
      "ĠQgxa": 668,
      "ĠQbxh": 669,
      "ĠQgxb": 670,
      "ĠQdxh": 671,
      "ĠQaxg": 672,
      "ĠQbxa": 673,
      "ĠQgxh": 674,
      "ĠQexa": 675,
      "ĠBhg": 676,
      "ĠQcxa": 677,
      "ĠQfxh": 678,
      "ĠQhxb": 679,
      "ĠQfxa": 680,
      "ĠQexh": 681,
      "ĠQcxh": 682,
      "ĠBed": 683,
      "ĠQdxa": 684,
      "ĠBfe": 685,
      "ĠBgd": 686,
      "ĠBbd": 687,
      "ĠBce": 688,
      "ĠBad": 689,
      "ĠBae": 690,
      "ĠBef": 691,
      "ĠBgf": 692,
      "ĠBbc": 693,
      "ĠBbe": 694,
      "ĠQaxh": 695,
      "ĠQhxa": 696,
      "ĠBeg": 697,
      "ĠBdf": 698,
      "ĠBfd": 699,
      "ĠBcd": 700,
      "ĠBhe": 701,
      "ĠBhf": 702,
      "ĠBac": 703,
      "ĠBda": 704,
      "ĠBdc": 705,
      "ĠBde": 706,
      "ĠBgc": 707,
      "ĠBge": 708,
      "ĠBgxe": 709,
      "ĠBfg": 710,
      "ĠBfh": 711,
      "ĠBcg": 712,
      "ĠBhd": 713,
      "ĠBhxf": 714,
      "ĠBab": 715
    },
    "merges": [
      "Ġ N",
      "Ġ R",
      "Ġ B",
      "Ġ K",
      "Ġ Q",
      "x d",
      "Ġ c",
      "Ġ e",
      "x e",
      "Ġ d",
      "ĠN f",
      "x c",
      "x f",
      "Ġ g",
      "Ġ h",
      "Ġ a",
      "Ġ b",
      "Ġ f",
      "ĠN c",
      "ĠB e",
      "ĠK f",
      "Ġ O",
      "x b",
      "x g",
      "ĠN d",
      "ĠN e",
      "ĠK g",
      "ĠB d",
      "ĠR a",
      "ĠB g",
      "ĠR e",
      "ĠR d",
      "ĠK e",
      "ĠR c",
      "ĠR f",
      "ĠQ d",
      "ĠB f",
      "ĠQ e",
      "ĠB b",
      "ĠR b",
      "ĠK d",
      "ĠQ c",
      "ĠK h",
      "ĠN b",
      "ĠB c",
      "x a",
      "x h",
      "ĠN g",
      "ĠQ f",
      "ĠK c",
      "ĠQ b",
      "ĠN xd",
      "Ġc xd",
      "ĠN xe",
      "ĠR h",
      "ĠR g",
      "ĠB xf",
      "ĠK b",
      "ĠR xd",
      "ĠQ xd",
      "ĠQ g",
      "Ġe xd",
      "ĠB xd",
      "ĠB xc",
      "ĠB xe",
      "ĠR xe",
      "ĠQ a",
      "ĠR xc",
      "Ġd xe",
      "ĠQ h",
      "Ġb xc",
      "ĠB h",
      "ĠQ xe",
      "ĠR xf",
      "Ġa xb",
      "ĠN xc",
      "Ġh xg",
      "ĠNb d",
      "Ġf xe",
      "ĠN a",
      "ĠN h",
      "ĠR xa",
      "ĠQ xf",
      "Ġd xc",
      "Ġg xf",
      "ĠB a",
      "ĠR xb",
      "ĠN xf",
      "ĠQ xc",
      "Ġe xf",
      "ĠB xg",
      "ĠQ xb",
      "ĠB xb",
      "ĠRa d",
      "ĠK a",
      "ĠR xg",
      "ĠR xh",
      "ĠK xg",
      "Ġf xg",
      "ĠK xf",
      "ĠQ xg",
      "ĠN xb",
      "ĠQ xa",
      "ĠRf d",
      "ĠN xg",
      "ĠRa c",
      "Ġc xb",
      "ĠRf e",
      "ĠB xa",
      "Ġg xh",
      "ĠB xh",
      "ĠQ xh",
      "ĠK xd",
      "Ġb xa",
      "ĠK xe",
      "ĠNg e",
      "ĠN xa",
      "ĠRa e",
      "ĠK xh",
      "ĠRa b",
      "ĠRf c",
      "N f",
      "ĠN xh",
      "ĠK xc",
      "ĠNf d",
      "ĠNg f",
      "ĠK xb",
      "ĠK xa",
      "ĠRh e",
      "ĠRe d",
      "ĠNc e",
      "ĠRc d",
      "ĠRd e",
      "ĠRh d",
      "ĠRf b",
      "ĠRa f",
      "ĠRh g",
      "ĠNb c",
      "ĠNd f",
      "ĠRd d",
      "ĠRh f",
      "ĠNd e",
      "ĠRb c",
      "ĠRe c",
      "ĠRd c",
      "ĠRe e",
      "ĠRb d",
      "ĠRc c",
      "ĠNe d",
      "ĠRc e",
      "ĠRd f",
      "ĠNc d",
      "ĠRd g",
      "ĠNd b",
      "ĠNf e",
      "ĠRh c",
      "ĠRa a",
      "ĠRb e",
      "ĠRb b",
      "ĠNe c",
      "ĠRf f",
      "ĠNh f",
      "ĠNb xd",
      "ĠRe f",
      "ĠRa g",
      "ĠRe b",
      "ĠRf a",
      "ĠNd xe",
      "ĠNc xe",
      "ĠNe g",
      "ĠNe f",
      "ĠNd c",
      "ĠNa c",
      "ĠRc b",
      "ĠNg xe",
      "ĠRg f",
      "ĠNf xd",
      "ĠRd b",
      "ĠRc f",
      "ĠRf xd",
      "ĠRa xd",
      "N c",
      "ĠRd h",
      "ĠNf g",
      "ĠRg e",
      "ĠRh b",
      "ĠNc b",
      "ĠRb f",
      "ĠRa xc",
      "ĠRe a",
      "ĠRg g",
      "ĠRh h",
      "ĠNf xe",
      "ĠRf g",
      "ĠRg d",
      "ĠNc xd",
      "ĠNe xd",
      "ĠRc a",
      "ĠRa h",
      "ĠRb a",
      "ĠRf xf",
      "ĠRc g",
      "ĠRe g",
      "ĠRd a",
      "ĠRd xd",
      "ĠNa b",
      "ĠRe xe",
      "ĠRc xc",
      "ĠRg c",
      "ĠRb g",
      "ĠRe xd",
      "ĠRb xb",
      "ĠRg h",
      "ĠRa xa",
      "ĠNd xc",
      "ĠRh a",
      "ĠNh g",
      "ĠRc xd",
      "ĠRf xe",
      "ĠNd xb",
      "ĠRb xc",
      "ĠRg xg",
      "ĠRa xb",
      "ĠRf h",
      "ĠRf xc",
      "ĠNg xf",
      "ĠRe h",
      "ĠNe xf",
      "ĠNb a",
      "ĠNd xf",
      "ĠRc h",
      "ĠQf f",
      "ĠNa xc",
      "ĠQg g",
      "ĠNg h",
      "ĠRh xf",
      "ĠRg b",
      "ĠQe e",
      "ĠRd xe",
      "ĠRd xc",
      "ĠNe xc",
      "ĠNc xb",
      "ĠNf xg",
      "ĠQc c",
      "ĠQb b",
      "ĠRa xe",
      "ĠQd d",
      "ĠNe xg",
      "ĠRh xh",
      "ĠRb xd",
      "ĠNh xf",
      "ĠRb h",
      "ĠNf h",
      "ĠNb xc",
      "ĠNc a",
      "ĠRd xf",
      "ĠRe xc",
      "ĠQh h",
      "ĠRe xf",
      "ĠQd b",
      "ĠQc a",
      "ĠQa a",
      "ĠQe c",
      "ĠRc xe",
      "ĠRc xb",
      "ĠRb xa",
      "ĠQe g",
      "ĠRg a",
      "ĠRb xe",
      "ĠRg xf",
      "ĠQf h",
      "ĠQf d",
      "ĠRa xf",
      "ĠQd f",
      "ĠRc xf",
      "ĠRh xe",
      "ĠRh xg",
      "ĠNa xb",
      "ĠQc e",
      "ĠRd xb",
      "ĠRh xd",
      "ĠNh xg",
      "ĠQg e",
      "ĠRc xa",
      "ĠRe xb",
      "ĠQb d",
      "ĠRb xf",
      "ĠQg f",
      "ĠRg xe",
      "ĠNb xa",
      "ĠQh f",
      "ĠRf xg",
      "ĠQf e",
      "ĠRg xd",
      "ĠRf xb",
      "ĠQc d",
      "ĠQb c",
      "ĠQd e",
      "ĠQa b",
      "ĠQh g",
      "ĠQa c",
      "ĠRh xc",
      "ĠQe d",
      "ĠRd xa",
      "ĠRd xg",
      "ĠNg xh",
      "ĠQe f",
      "N h",
      "ĠQd c",
      "ĠQa d",
      "ĠNf xh",
      "ĠRe xg",
      "ĠQh e",
      "ĠQb e",
      "ĠRg xh",
      "ĠQf g",
      "ĠQg d",
      "ĠNc xa",
      "ĠRe xa",
      "ĠQc b",
      "ĠQf c",
      "ĠQa e",
      "ĠQc f",
      "ĠRc xg",
      "N a",
      "ĠQh d",
      "ĠQd g",
      "ĠRa xg",
      "ĠRf xa",
      "ĠQb f",
      "ĠRg xc",
      "ĠQe b",
      "ĠRf xh",
      "ĠQf b",
      "ĠQg c",
      "ĠRb xg",
      "ĠQc g",
      "ĠQa f",
      "ĠQh c",
      "ĠRd xh",
      "ĠQe h",
      "ĠRe xh",
      "ĠQb g",
      "ĠQf xf",
      "ĠQa g",
      "ĠQg xg",
      "ĠRh xb",
      "ĠQd h",
      "ĠQe xe",
      "ĠQe xf",
      "ĠQg b",
      "ĠRg xb",
      "ĠQe a",
      "ĠQd a",
      "ĠRc xh",
      "ĠQh xh",
      "ĠQd xd",
      "ĠQc xc",
      "ĠQf xg",
      "ĠQd xf",
      "ĠQd xe",
      "ĠQb xb",
      "ĠQe xg",
      "ĠQc xf",
      "ĠQh b",
      "ĠRa xh",
      "ĠQc h",
      "ĠRg xa",
      "ĠQg xf",
      "ĠQa xa",
      "ĠQc xd",
      "ĠQf xe",
      "ĠQb h",
      "ĠQh xf",
      "ĠRb xh",
      "ĠQg h",
      "ĠQc xe",
      "ĠQb xe",
      "ĠQd xc",
      "ĠQb xc",
      "ĠQb a",
      "ĠQh xg",
      "ĠRh xa",
      "ĠQc xg",
      "ĠQb xd",
      "ĠQd xg",
      "ĠQe xd",
      "ĠQb xf",
      "ĠQg a",
      "ĠQa xb",
      "ĠQf a",
      "ĠQa xc",
      "ĠQa xe",
      "ĠQg xe",
      "ĠQa h",
      "ĠQa xd",
      "ĠQf xd",
      "ĠQe xc",
      "ĠQc xb",
      "ĠQh a",
      "ĠQf xc",
      "ĠQg xd",
      "ĠQh xe",
      "ĠQd xb",
      "ĠQg xc",
      "ĠQb xg",
      "ĠQh xc",
      "ĠQe xb",
      "ĠQf xb",
      "ĠQh xd",
      "ĠQa xf",
      "ĠQg xa",
      "ĠQb xh",
      "ĠQg xb",
      "ĠQd xh",
      "ĠQa xg",
      "ĠQb xa",
      "ĠQg xh",
      "ĠQe xa",
      "ĠBh g",
      "ĠQc xa",
      "ĠQf xh",
      "ĠQh xb",
      "ĠQf xa",
      "ĠQe xh",
      "ĠQc xh",
      "ĠBe d",
      "ĠQd xa",
      "ĠBf e",
      "ĠBg d",
      "ĠBb d",
      "ĠBc e",
      "ĠBa d",
      "ĠBa e",
      "ĠBe f",
      "ĠBg f",
      "ĠBb c",
      "ĠBb e",
      "ĠQa xh",
      "ĠQh xa",
      "ĠBe g",
      "ĠBd f",
      "ĠBf d",
      "ĠBc d",
      "ĠBh e",
      "ĠBh f",
      "ĠBa c",
      "ĠBd a",
      "ĠBd c",
      "ĠBd e",
      "ĠBg c",
      "ĠBg e",
      "ĠBg xe",
      "ĠBf g",
      "ĠBf h",
      "ĠBc g",
      "ĠBh d",
      "ĠBh xf",
      "ĠBa b"
    ]
  }
}